// Задача 8.Дефинирайте едномерен масив int с 10 елемента =
// {100,90,80,70,60,50,40,30,20,10} Дефинирайте пойнтер, който ще сочи към
// масива.
// Достъпете 3 тия елемент от масива и му задайте стойност 5.
// Достъпете 4 тия елемент и му задайте стойност 33.
// Достъпете 5 тия елемент и го намалете със 7.
// Достъпете 7 мия елемент и го увеличете с 10.
// Достъпете 10 тия елемент и го умножете по 3.
// Изпишете го по двата възможни начина и закоментирайте единия.
// Принтирайте на екрана всички елементи на масива.
#include <stdio.h>
void printArr(int a[], int l);
int main(){
 int arrNum[] = {100,90,80,70,60,50,40,30,20,10};
 int* ptr = &arrNum[0];
 
 /*first way: with pinter*/
 ptr[3] = 5;
 ptr[4] = 33;
 ptr[5] -= 7;
 ptr[7] += 10;
 ptr[10] *= 3;

/*second way: accessing the array
  arrNum[3] = 5;
  arrNum[4] = 33;
  arrNum[5] -= 7;
  arrNum[7] += 10;
  arrNum[10] *= 3;*/

 printArr(arrNum,10);

 return 0;
}

 void printArr(int* a, int l){

     for (int i = 0; i <l; i++)
     {
         printf("\n%d",a[i]);
     }
     
 }

