// Задача 1. Дефинирайте и инициализирайте едномерен масив с 5
// елемента. След като сте готови, направете въвеждане на данните в
// масива, като четете от потребителя със scanf.

#include <stdio.h>
#include <string.h>
int main(){
int s[5];
printf("enter 5 ints:\n");
scanf("%d",&s[0]);
scanf("%d",&s[1]);
scanf("%d",&s[2]);
scanf("%d",&s[3]);
scanf("%d",&s[4]);

 return 0;
}

