// Задача 10.
// Как работи? Дефинираме променлива “а“, дефинираме
// пойнтер, но още не му задаваме стойност. Отпечатайте
// адреса на “а”. След това присвояваме стойност на
// пойнтера, като внимаваме типовете на пойнтера и
// променливата да са от един и същи тип. Отпечатваме
// на екрана стойността на пойнтера с %р, стойността на
// „а“ с %d, стойността на *ptr с %d.
#include <stdio.h>
#include <stdlib.h>

int main(){
    int a;
    printf("%p\n",&a);
    int* pInt = &a;
    printf("%p\n",pInt);
    *pInt = 3;
    printf("%d\n",a);
    printf("%d\n",*pInt);


 return 0;
}