// Задача 11.
// Напишете програма, която умножава 2 числа, като
// използва пойнтер-и.
// Пойнтер-ите не са страшни. Дефинират се като
// тип *Х и се използват като *Х. Както променливите,
// но със * отпред (и 1 наум!).
// Продължение: Опитайте да умножите 2 променливи от
// различен тип, използвайки пойнтери.
#include <stdio.h>
#include <stdlib.h>

int main(){
    int a = 3;
    int* pA = &a;
    int b = 5;
    int* pB = &b;
    *pA *= *pB;
    printf("%d",a);

    //operation of pointers of different types
    // double a = 3.3;
    // double* pA = &a;
    // int b = 5;
    // int* pB = &b;
    // *pA *= *pB;
    // printf("%d",a);


 return 0;
}