// Задача 6.
// Дефинирайте променлива „а“, дeфинирайте пойнтер към
// нея, присвоете му адреса на променливата. През пойнтера
// задайте нова стойност = 5 на променливата „а“. Каква е
// стойността на “а”?
#include <stdio.h>
#include <stdlib.h>

int main(){
    int a = 3;
    int* pInt = &a;
    *pInt = 5;

   printf("%d\n",a);



 return 0;
}