// Задача 7.
// Направете програма, в която инициализирате пойнтер към
// променлива и след това изчислявате сбор на променливата
// (използвайки пойнтера) + 5. Отпечатайте на екрана.
#include <stdio.h>
#include <stdlib.h>

int main(){
    int a = 3;
    int* pInt = &a;
    *pInt+=5;

    printf("%d\n",a);



 return 0;
}