// Задача 10.
// Да намерим простите числа до 1000 и да ги сложим в масив.
// Да напишем функция, която да ни казва дали дадено число от 0 - до 1000
// е просто.
// Просто число е се нарича всяко естествено число, по-голямо от 1,
// което има точно два естествени делителя – 1 и самото себе си.
// Например 5 е просто, защото се дели единствено на 1 и 5, докато 6 не
// е, защото се дели освен на 1 и 6, и на 2 и 3.

#include <string.h>
#include <stdio.h>
#include <stdlib.h>

int isPrime(int a){
    int i = 0;
    for (i = 2; i <= a / 2; ++i) {
        // condition for non-prime
        if (a % i == 0) {
            return 0;
            break;
        }
    }
    return 1;      

}

int main(){
int arr[1000];
int j = 0;
for (int i = 0; i < 1000; i++)
{
    if (isPrime(i))
    {
        printf("%d ",i);
        arr[j++] = i;
    }
    
}

    
    
 return 0;
}