// Задача 16.
// Имаме 2 сортирани масиви А и В с по 88 елемента.
// Образувайте масив С с 2х88 елемента образуван от смесването на А и В,
// така че С да съдържа елементите на А и В, но да е подреден и да не се
// налага да го сортираме отново.
// Насоки: Проверяваме от кой масив да вземем следващия елемент за
// слагане в масива /цикъл и проверка./
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
void mergeArrays(int* arr1, int* arr2,int* mergedArr){
    for (int i = 0; i < 4; i++)
    {
        for (int j = 0; j < 4; j++)
        {
        
        }
    }
    
}
int main(){
    int arr1[] = {1,2,3,4};
    int arr2[] = {3,4,5,6};
    int mergedArr[176];

 return 0;
}